In [1]:
import pandas as pd
import numpy as np

In [121]:
df = pd.DataFrame({"Name":['James', 'Ken', 'Tom', 'Helen'], "ID":[11,12,13,14],"Age": [16,17,15,18],\
                   "Score":[80,78, 98, 87]}, index = [1, 3, 4, 2])
df

   Age  ID   Name  Score
1   16  11  James     80
3   17  12    Ken     78
4   15  13    Tom     98
2   18  14  Helen     87

## Slicing rows 
Refer [here](http://stackoverflow.com/questions/31593201/pandas-iloc-vs-ix-vs-loc-explanation)

In [122]:
# by index
df.ix[:3]

   Age  ID   Name  Score
1   16  11  James     80
3   17  12    Ken     78

In [123]:
# by index
df.loc[:3]

   Age  ID   Name  Score
1   16  11  James     80
3   17  12    Ken     78

In [124]:
# by natural row number
df.iloc[:3]

   Age  ID   Name  Score
1   16  11  James     80
3   17  12    Ken     78
4   15  13    Tom     98

In [125]:
df[ :: ]

   Age  ID   Name  Score
1   16  11  James     80
3   17  12    Ken     78
4   15  13    Tom     98
2   18  14  Helen     87

## Slicing column

In [126]:
df.ix[:, [1, -1]]

   ID  Score
1  11     80
3  12     78
4  13     98
2  14     87

In [127]:
df.ix[:, [1,2]]

   ID   Name
1  11  James
3  12    Ken
4  13    Tom
2  14  Helen

In [128]:
df.ix[:, [0,2]]

   Age   Name
1   16  James
3   17    Ken
4   15    Tom
2   18  Helen

In [129]:
df[['Name', 'Score']]

    Name  Score
1  James     80
3    Ken     78
4    Tom     98
2  Helen     87

## Manipulating data - map, apply, applymap

In [130]:
# apply works on a row/column basis of a DataFrame
df3 = df['Score'].apply(lambda x: x+2)
df3

1     82
3     80
4    100
2     89
Name: Score, dtype: int64

In [131]:
df4 = df[['Score', 'Age']].apply(lambda x: x+2)
df4

   Score  Age
1     82   18
3     80   19
4    100   17
2     89   20

In [132]:
# map only use in Series
df3 = df['Score'].map(lambda x: x+2)
df3

1     82
3     80
4    100
2     89
Name: Score, dtype: int64

In [133]:
# applymap use in dataframe
df2 = df[['Score', 'Age']].applymap(lambda x: x+2)
df2

   Score  Age
1     82   18
3     80   19
4    100   17
2     89   20

## Filtering data

In [134]:
df[df['Score']>85]

   Age  ID   Name  Score
4   15  13    Tom     98
2   18  14  Helen     87

In [135]:
df[(df['Score']>85) & (df['Age']<18)]

   Age  ID Name  Score
4   15  13  Tom     98

In [136]:
df[df['Name'] >='K']

   Age  ID Name  Score
3   17  12  Ken     78
4   15  13  Tom     98

## JOIN data

In [143]:
df_class = pd.DataFrame({"ID":[11,12,13,14], "class":['A', 'A','B','C']}, index = [1, 3, 4, 2])
df_class

   ID class
1  11     A
3  12     A
4  13     B
2  14     C

In [144]:
df_student = pd.DataFrame({"Name":['James', 'Ken', 'Tom', 'Helen'], "ID":[11,12,13,14],"Age": [16,17,15,18],\
                   "Score":[80,78, 98, 87]}, index = [1, 3, 4, 2])

In [145]:
# Use merge

student = pd.merge(df_student, df_class, on='ID')  # new dataframe has only one ID columns
student

   Age  ID   Name  Score class
0   16  11  James     80     A
1   17  12    Ken     78     A
2   15  13    Tom     98     B
3   18  14  Helen     87     C

In [149]:
# Use concate
pd.concat([df_student, df_class], axis=1) # the new dataframe has two ID columns, you need to specifiy the axis

   Age  ID   Name  Score  ID class
1   16  11  James     80  11     A
3   17  12    Ken     78  12     A
4   15  13    Tom     98  13     B
2   18  14  Helen     87  14     C

In [168]:
# Use join, have to reset_index

df_student.reset_index('ID').join(df_class.reset_index('ID'), how='inner', lsuffix='_l', rsuffix='_r')

   index_l  Age  ID_l   Name  Score  index_r  ID_r class
0        1   16    11  James     80        1    11     A
1        3   17    12    Ken     78        3    12     A
2        4   15    13    Tom     98        4    13     B
3        2   18    14  Helen     87        2    14     C

## Use crosstab

In [170]:
pd.crosstab(student['class'], student.Score)

Score  78  80  87  98
class
A       1   1   0   0
B       0   0   0   1
C       0   0   1   0

## Use Unique

In [172]:
student['class'].unique()

array(['A', 'B', 'C'], dtype=object)

## Convert a Series to a Dictionary 
refer [here](http://stackoverflow.com/questions/27034794/convert-series-to-list-of-dict-in-pandas)

In [4]:
s = pd.Series(['A', 'B','C', 'D','A','B','D','A','D'])
s

0    A
1    B
2    C
3    D
4    A
5    B
6    D
7    A
8    D
dtype: object

In [8]:
# convert to a dictionary
cnt = s.value_counts().to_dict()
cnt

{'A': 3, 'B': 2, 'C': 1, 'D': 3}

In [11]:
# convert to a list of dictionaries
lst = [{k: v} for (k, v) in cnt.iteritems()]
lst

[{'A': 3}, {'C': 1}, {'B': 2}, {'D': 3}]

In [12]:
# convert it back to a series

dct= {}
for item in lst:
    for k, v in item.iteritems():
        dct[k] = v
print dct

{'A': 3, 'C': 1, 'B': 2, 'D': 3}

In [15]:
lst1 =[]
for k, v in dct.iteritems():
    lst1.extend(list(k*v))
    
print pd.Series(lst1)

0    A
1    A
2    A
3    C
4    B
5    B
6    D
7    D
8    D
dtype: object